"""
Отрицательные, положительные и нули
Напишите программу, запрашивающую у пользователя целые числа,
пока он не оставит строку ввода пустой.
После окончания ввода на экран должны быть выведены сначала все отрицательные числа,
которые были введены, затем нулевые и только после этого положительные.
Внутри каждой группы числа должны отображаться в той последовательности,
в которой были введены пользователем.
Например, если он ввел следующие числа: 3, -4, 1, 0, -1, 0 и -2,
вывод должен оказаться таким: -4, -1, -2, 0, 0, 3 и 1.
Каждое значение должно отображаться на новой строке.
"""

first_list = []
second_list = []
third_list = []
ent = None
while True:
    ent = input("Введите число: ")
    if ent == "":
        break
    elif int(ent) > 0:
        first_list.append(ent)
    elif int(ent) < 0:
        second_list.append(ent)
    elif int(ent) == 0:
        third_list.append(ent)
final_list = first_list + second_list + third_list
print("Вы ввели следующие числа:")
for num in final_list:
    print(num)
