'''
Если помните, на старых мобильных телефонах текстовые сообщения набирались при помощи цифровых
кнопок. При этом одна кнопка была ассоциирована сразу с несколькими буквами, а выбор зависел от
количества нажатий на кнопку. Однократное нажатие приводило к появлению первой буквы в
соответствующем этой кнопке списке, последующие нажатия меняли ее на следующую.
Напишите программу, отображающую последовательность кнопок, которую необходимо нажать, чтобы на
экране телефона появился текст, введенный пользователем. Создайте словарь, сопоставляющий символы с
кнопками, которые необходимо нажать, а затем воспользуйтесь им для вывода на экран
последовательности кнопок в соответствии с введенным пользователем сообщением по запросу.
Например, на ввод строки Hello, World! ваша программа должна откликнуться следующим выводом:
4433555555666110966677755531111.
Удостоверьтесь, что ваша программа корректно обрабатывает строчные и прописные буквы.
При преобразовании букв в цифры игнорируйте символы, не входящие в указанный перечень, такие
как точка с запятой или скобки.
'''


def message_converse(text_input):
    """Преобразует введенное текстовое сообщение в комбинацию кнопок, которую необходимо нажать
    на кнопочном телефоне. Возвращает  комбинацию кнопок соответствующую сообщению.
    """
    char_input = list(text_input.upper())
    dict_phone = {'1': ['.', ',', '?', '!', ':'],
                  '2': ['A', 'B', 'C'],
                  '3': ['D', 'E', 'F'],
                  '4': ['G', 'H', 'I'],
                  '5': ['J', 'K', 'L'],
                  '6': ['M', 'N', 'O'],
                  '7': ['P', 'Q', 'R', 'S'],
                  '8': ['T', 'U', 'V'],
                  '9': ['W', 'X', 'Y', 'Z'],
                  '0': [' ']
                  }
    output_number = []
    for i in range(0, len(char_input)):
        for key in dict_phone:
            j = 1
            for value in dict_phone[key]:
                if value == char_input[i]:
                    output_number.append(key * j)
                else:
                    j += 1
    return output_number


text_input = input('Введите текстовое сообщение: ')
new_message = ''.join(message_converse(text_input))
print(f'Наберите на телефоне следующую последовательность: {new_message}')
