"""
Напишите программу, которая считает общую цену.
Вводится M рублей и N копеек цена, а также количество S товара
Посчитайте общую цену в рублях и копейках за L товаров
"""


a = float(input('Введите цену товара:'))
c = int(input('Введите количество товара:'))
print('Общая стоимость:', a*b, 'рублей')
